[{"mainText": "Intelligent search. Recently, I started working on a business problem, where people want to search relevant material through many sources of documents by asking a question. This can be solved using model such as DrQA, with the data set similar to SQuAD. However, in order to use this model, the training data needs to be in question and answer pairs. This requires a lot of preprocessing to build up a good data set. So the next thing we did is to use Solr to index the database first, creating links to the source and raw text of the source document. Searching by the question against the content of the Solr database, we first find the relevant document. Once we find the relevant document, we first try to use machine comprehension function of AllenNLP to find the answer in the document. However, because AllenNLP use attention model, when the document is large ( > 90,000 characters), the model require too much memory. So we tried Google’s Talk to Book approach. Using Universal Sentence Encoder by tensorflow, we separated the document into pages or paragraphs, and find the most similar page or paragraph to our question. This did not work because our question is in a question form and it is structurally different from the source document content. So we can either compare using a statement form to the document, or convert the document into many questions, and find which paragraph is the most similar to our question. We tried the first option and used a statement to to find the most similar paragraph. It work fine and the 2nd most relevant answer was the one we are looking for. But from a user perspective, we cannot limit the user to not search in a question format. So we used Spacy and filtered out STOP WORDS, which include things like “what”, “how”, “do”, “I” and all the frequent words. This essentially turn question or statement into keywords we can use for search. Another improvement we made was pulling top 3 most relevant document, parsed every paragraph from those documents and find the most relevant paragraph, regardless of where it came from. In this way, we able to rank the most relevant “paragraph” from multiple sources, and improve the search result as a whole.", "redirectionUrl": "https://data.panzoto.com", "uid": "urn:uuid:b095ec6d-acd8-4a6f-b6f7-8c767961006f", "titleText": "Panzoto's Artificial Intelligence News Brief", "updateDate": "2018-05-27T13:34:19.0Z"}, {"mainText": "You know how powerful transfer learning is for image processing? Now imagine you can do the same for text and even sequence in general. This is what fast.ai can do. Checkout Universal Language Model Fine-tuning", "redirectionUrl": "https://data.panzoto.com", "uid": "urn:uuid:b7725db6-67da-4eb2-8cda-1e1cde963d6e", "titleText": "Panzoto's Artificial Intelligence News Brief", "updateDate": "2018-05-27T22:51:27.0Z"}, {"mainText": "Did you learn the best your can do for sorting is O(n log n)? Did you ever think you can do better than that? Check out the #MachineLearning way to sort, so you can get the answer in O(n) time? https://arxiv.org/abs/1805.04272", "redirectionUrl": "https://data.panzoto.com", "uid": "urn:uuid:7971ed7c-3aca-42a3-802d-ed76e4ff021c", "titleText": "Panzoto's Artificial Intelligence News Brief", "updateDate": "2018-05-30T18:15:30.0Z"}, {"mainText": "Check out Google's latest Zero-shot dual machine translation. This could be a godsend for languages that have few translations. One more step moving towards Universal Machine Translation, where everything translate to everything else.", "redirectionUrl": "https://data.panzoto.com", "uid": "urn:uuid:a9f4ccec-cfa3-457c-b682-78ecaf2d87d2", "titleText": "Panzoto's Artificial Intelligence News Brief", "updateDate": "2018-06-01T01:12:44.0Z"}, {"mainText": "Check out Google's latest Zero-shot dual machine translation. This could be a godsend for languages that have few translations. One more step moving towards Universal Machine Translation, where everything translate to everything else.", "redirectionUrl": "https://data.panzoto.com", "uid": "urn:uuid:8def12ba-0dcf-42fb-95a2-45c984affcb0", "titleText": "Panzoto's Artificial Intelligence News Brief", "updateDate": "2018-06-02T12:30:05.0Z"}, {"mainText": "Have you ever used Batch Normalization? Do you ever wonder how it work so well? Recent theoretical work revealed that it make optimization landscape significantly smoother and accelerates optimization with gradient-based methods. It's like you have less of a bumpy road to drive. Of course you are going to get to you destination faster.", "redirectionUrl": "https://data.panzoto.com", "uid": "urn:uuid:36a85449-8667-48d5-890e-70615c331c6c", "titleText": "Panzoto's Artificial Intelligence News Brief", "updateDate": "2018-06-02T12:30:14.0Z"}, {"mainText": "Google released their new paper on Auto Augment, which use Reinforcement Learning to find the best way to augment image data.", "redirectionUrl": "https://data.panzoto.com", "uid": "urn:uuid:70bd18d6-8f59-4739-90e8-0b9f6229f4e7", "titleText": "Panzoto's Artificial Intelligence News Brief", "updateDate": "2018-06-07T12:46:23.0Z"}]